{
  "theme": {
    "slug": "asian-inspired",
    "name": "Asian Inspired",
    "description": "Flavors from China, Japan, Thailand, Korea and beyond"
  },
  "metadata": {
    "recipeCount": 18,
    "lastUpdated": "2026-01-18T06:49:07.296Z"
  },
  "recipes": [
    {
      "id": "chow-mein",
      "slug": "chow-mein",
      "title": "Chow Mein",
      "image": "https://www.recipetineats.com/tachyon/2018/08/Chow-Mein_1.jpg",
      "prepTime": "10 min",
      "cookTime": "5 min",
      "totalTime": "15 min",
      "servings": "2",
      "ingredients": [
        "200g /6 oz chicken breast or thigh fillets (thinly sliced (Note 1 tenderise option))",
        "4 cups green cabbage (finely shredded (Note 3))",
        "1 1/2 tbsp peanut oil (or other cooking oil)",
        "2 cloves garlic (finely chopped)",
        "200g /6 oz chow mein noodles (Note 2)",
        "1 carrot (julienned)",
        "1 1/2 cups bean sprouts",
        "3 green onions (cut into 5cm/2\" pieces)",
        "1/4 cup (65 ml) water",
        "2 tsp cornflour / cornstarch",
        "1 1/2 tbsp soy sauce (all purpose or light (Note 4))",
        "1 1/2 tbsp oyster sauce (sub Hoisin)",
        "1 1/2 tbsp Chinese cooking wine (OR Mirin (Note 5))",
        "2 tsp sugar (reduce to 1 tsp if using Mirin)",
        "1/2 tsp sesame oil",
        "White pepper (sub black)"
      ],
      "instructions": [
        "Mix together cornflour and soy sauce, then mix in remaining ingredients.",
        "Alternative: Use 1/3 cup Chinese All Purpose Stir Fry Sauce, if you have some in stock.",
        "Marinate Chicken: Pour 1 tbsp of Sauce over the chicken, mix to coat, set aside to marinate for 10 minutes.",
        "Noodles: Prepare the noodles according to the packet instructions (my pack says soak in boiled water for 1 minute), then drain.",
        "Heat oil in wok or large fry pan over high heat.",
        "Add garlic and stir fry for 10 seconds or until it starts to turn golden - don't let it burn!",
        "Add chicken and stir fry until the surface gets a tinge of browning but inside is still raw - about 1 minute.",
        "Add the cabbage, carrot, and the white pieces of shallots (i.e. from the base of the stalk). Stir fry for 1 1/2 minutes until the cabbage is mostly wilted.",
        "Add the noodles, Sauce and water*. Stir fry for 1 minute, tossing constantly.",
        "Add bean sprouts and remaining shallots/scallions. Toss through for 30 seconds or until the bean sprouts just start to wilt.",
        "Remove from heat and serve immediately."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/chicken-chow-mein/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:21.500Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "kung-pao-chicken",
      "slug": "kung-pao-chicken",
      "title": "Kung Pao Chicken",
      "image": "https://www.recipetineats.com/tachyon/2018/09/Kung-Pao-Chicken.jpg",
      "prepTime": "15 min",
      "cookTime": "10 min",
      "totalTime": "25 min",
      "servings": "4",
      "ingredients": [
        "1 lb / 500g chicken thigh (cut into bite size pieces)",
        "2 tsp cornflour / cornstarch",
        "1 tbsp light soy sauce (Note 2)",
        "1.5 tbsp dark soy sauce (Note 3)",
        "2 tbsp Chinese black vinegar (Note 4)",
        "1 tbsp Chinese cooking wine (Note 5)",
        "3 tbsp sugar (any)",
        "1/2 tsp sesame oil",
        "1/3 cup water",
        "2 tbsp peanut oil (or other cooking oil)",
        "2 garlic cloves (minced)",
        "1 tsp ginger (finely chopped)",
        "6 - 10 dried chillies ((adjust to taste), cut into 2cm/ 3/4\" pieces, most seeds discarded (Note 7))",
        "3 green onions (cut into 2cm/ 3/4\" pieces, white parts separated from green)",
        "1.5 tsp ground sichuan peppercorns (adjust to taste (Note 6))",
        "3/4 cup whole peanuts (or 1/2 cup halved) (roasted unsalted)"
      ],
      "instructions": [
        "Mix cornflour and soy sauce in a small bowl until cornflour is dissolved. Then mix in remaining Sauce ingredients EXCEPT water.",
        "Pour 1.5 tbsp Sauce over chicken. Toss to coat, set aside for 10 - 20 minutes.",
        "Add water into remaining Sauce.",
        "Heat oil in wok over high heat. Add garlic, ginger and chillies. Cook for 30 seconds or until fragrant.",
        "Add chicken, cook until it turns white, then add the white part of the green onions. Cook until chicken is cooked through - about 2 minutes.",
        "Add Sauce and Sichuan pepper. Bring to simmer, mixing constantly, until almost all the sauce reduces to a thick syrup.",
        "Just before the end, mix through peanuts and green part of the green onions. Also check spiciness - add more Sichuan pepper if you can handle the heat!",
        "Serve immediately with rice - or for a low carb, low cal option, try Cauliflower Rice!"
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/kung-pao-chicken/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:26.291Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "sweet-and-sour-pork",
      "slug": "sweet-and-sour-pork",
      "title": "Sweet and Sour Pork",
      "image": "https://www.recipetineats.com/tachyon/2020/08/Sweet-and-Sour-Pork_7-SQ.jpg",
      "prepTime": "20 min",
      "cookTime": "30 min",
      "totalTime": null,
      "servings": "5",
      "ingredients": [
        "400g/14oz pork scotch roast (aka pork neck, collar butt) or shoulder / butt, (cut into 2cm / 4/5\" cubes (Note 1))",
        "1/2 onion (finely grated (Note 2a))",
        "1 tsp garlic (finely grated (Note 2a))",
        "1 tsp ginger (finely grated (Note 2a))",
        "3/8 tsp baking soda (bi-carb) (Note 2b)",
        "2 tsp cornflour/cornstarch",
        "2 tbsp light soy sauce (or all purpose (Note 3))",
        "5 tbsp cornflour/cornstarch (- for mixing in)",
        "1/2 cup cornflour/cornstarch (- for Coating)",
        "2 - 3 cups vegetable or canola oil",
        "1/3 cup white sugar",
        "1/3 cup apple cider vinegar (or 1/4 cup normal white vinegar)",
        "3 tbsp pineapple juice (from a 227g/8oz can pineapple pieces in juice, preferably no added sugar, Note 4)",
        "3 tbsp ketchup (or Aussie tomato sauce)",
        "1/2 tsp Worcestershire sauce",
        "1 tbsp soy sauce (light)",
        "1 tsp Oyster Sauce (Note 5)",
        "4 tsp cornflour/corn starch",
        "1/2 cup water",
        "1 tbsp oil",
        "1 garlic clove (finely chopped)",
        "2 tsp ginger (finely chopped)",
        "1 onion ((medium), cut into 2.5cm/ 1\" cubes (brown, white, yellow))",
        "1/2 red capsicum/bell pepper ((large), cut into 2.5cm / 1\" cubes)",
        "1/2 green capsicum/bell pepper ((large), cut into 2.5cm / 1\" cubes)",
        "1 cup pineapple pieces (from the can of pineapple under Sauce)"
      ],
      "instructions": [
        "Mix Pork with Marinade. Marinade 18 to 24 hours. (See Note 1 for marinating time for other cuts)",
        "Rack & warm oven: Preheat oven to 80°C/175°F and place rack on tray - to keep pork warm.",
        "Sauce: Place all Sauce ingredients EXCEPT water in a large jug or small bowl. Mix until combined, then mix in water.",
        "Be Stir Fry Ready: Have all ingredients lined up, ready to toss in. After Fry #2, things move quickly.",
        "Coating #1: Mix 5 tablespoons cornflour into the pork and leave for 5 minutes. At first, it will be white from the cornflour, but after a while it will sweat and make the cornflour (mostly / partially) wet, and will be sticky (this is key for coating to stick).",
        "Coating #2: Spread 1/2 cup cornflour in a shallow bowl. Coat pork, shaking off excess, and pile onto a plate.",
        "Reserve cornflour in case you need to dust again just prior to frying. Pork should be at least half white when you put it into the oil (if not, just sprinkle with reserved cornflour).",
        "Heat oil: Pour enough oil into a large saucepan or small pot so it's 2.5cm / 1\" deep. Heat to 180°C/350°F (or until pork immediately starts sizzling when you dip it in).",
        "Fry #1: Cook pork in batches, being sure not to crowd the pot, for 3 minutes until golden. Drain on rack. This step is just to cook the pork. It takes me 4 batches.",
        "Fry #2: Turn the stove up slightly and heat oil to 200°C/390°F. Starting with the coolest pork, add half the pork (you can crowd the pot) and cook for 1 1/2 minutes, or until pork is deep golden brown and crispy. Transfer to rack, repeat with remaining pork - I do 2 batches.",
        "Keep warm in oven.",
        "Heat oil in a very large skillet over high heat.",
        "Add garlic, ginger and onion, stir for 1 1/2 minutes. Add capsicum and stir for 2 minutes.",
        "Add Sauce & pinapple, then let it come to a rapid simmer. Simmer for 2 minutes until it thickens - when you drag the spoon across the base, a path should briefly appear (see video at 1 min 53 s).",
        "10 second toss: Add pork, then QUICKLY toss to coat - aim for 10 seconds!",
        "Serve asap! Pour onto serving plate, serve immediately! Will stay crispy for around 5 minutes then starts softening but still has a solid coating. This is just the reality of Sweet and Sour Pork, even at restaurants!"
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/sweet-and-sour-pork/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:28.124Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "general-tsos-chicken",
      "slug": "general-tsos-chicken",
      "title": "General Tso's Chicken",
      "image": "https://www.recipetineats.com/tachyon/2020/10/General-Tsao-Chicken_1-SQ.jpg",
      "prepTime": "15 min",
      "cookTime": "10 min",
      "totalTime": null,
      "servings": "4",
      "ingredients": [
        "3 tbsp soy sauce - light or all-purpose (NOT dark soy, Note 1)",
        "1 tbsp hoisin sauce",
        "1 tbsp rice vinegar (sub white wine vinegar)",
        "2 tsp chilli paste (any (Sambal Oelak is great))",
        "1 tsp sesame oil (toasted preferably (Note 6))",
        "3 tbsp brown sugar",
        "1 tbsp cornflour/cornstarch",
        "3/4 cup chicken stock/broth (low sodium)",
        "600g/ 1.4 lb chicken thighs (boneless skinless, cut into 2.5cm / 1\" pieces (breast / tenderloin - Note 2))",
        "1 tsp ginger (finely grated)",
        "1 tsp garlic (finely grated)",
        "1 cup cornflour/cornstarch (Note 5)",
        "1 - 4 cups oil, for frying (peanut, vegetable or canola; Note 4)",
        "2 tbsp oil (peanut, vegetable or canola)",
        "2 tsp ginger (finely chopped (Note 3))",
        "2 cloves garlic (finely chopped (Note 3))",
        "1/2 teaspoon red chilli flakes (red pepper flakes)",
        "Finely sliced green onion",
        "Sesame seeds"
      ],
      "instructions": [
        "Sauce-Marinade: Mix the soy, hoisin, vinegar, chilli and sesame oil.",
        "Marinate Chicken: Take out 2 tablespoons of Sauce-Marinade and mix with chicken. Add ginger and garlic to chicken, mix, then marinate 30 minutes.",
        "Dust chicken: Add cornflour into chicken and toss to coat, ensuring pieces are separated so they get fully coated.",
        "Shake off excess: Tip into a colander and shake to remove excess cornflour (or grab handfuls, shake so cornflour falls through your fingers).",
        "Finish Sauce: To the remaining Sauce-Marinade (that you made in Step 1), add sugar and cornflour. Mix, then add chicken stock and mix.",
        "Heat oil: Heat 2 cm / 4/5\" oil in a deep skillet (or large pot - whatever you’re comfortable with) to 200°C/390°F. To use less, see Note 4.",
        "Fry: Cook chicken 3 minutes, turning halfway, until golden and crispy. Drain on paper towel lined plate.",
        "New / clean skillet: Discard oil, wipe skillet and return to heat. Or use another large skillet.",
        "Stir Fry Sauce: Heat oil in a large skillet over medium heat. Add garlic, ginger, chilli flakes, saute 30 seconds until garlic is light golden. Add Sauce, bring to simmer and stir occasionally until it thickens enough that you can draw a path across pan base.",
        "Toss! Add chicken, toss to coat quickly - the quicker you are, the crispier the chicken stays! Transfer to serving plate, garnish and serve immediately with your rice of choice."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/general-tsos-chicken/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:29.842Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "teriyaki-salmon-noodles",
      "slug": "teriyaki-salmon-noodles",
      "title": "Teriyaki Salmon Noodles",
      "image": "https://www.recipetineats.com/tachyon/2022/07/Teriyaki-Salmon-Noodles_1-1-SQ.jpg",
      "prepTime": "5 min",
      "cookTime": "10 min",
      "totalTime": null,
      "servings": "2",
      "ingredients": [
        "2 tbsp oil (veg or canola)",
        "250 g / 8 oz salmon fillet ((s), skinless, sliced into 2cm / 0.7\" strips (lengthwise, Note 1))",
        "2 instant noodle / ramen noodle cakes ((discard seasoning packs) (Note 2 other noodles))",
        "1/2 onion (cut into 1cm / 0.3\" slices)",
        "1 garlic clove (finely minced)",
        "1 small bunch Chinese broccoli ((gai lan), cut into 5 cm / 2\" lengths, leaves separated from stem (Note 3))",
        "2 1/2 tbsp soy sauce (light or all-purpose (Note 4))",
        "2 tbsp mirin (Note 5)",
        "2 tbsp cooking sake (Note 5)",
        "1 tsp white sugar"
      ],
      "instructions": [
        "Teriyaki Sauce: Mix the ingredients in a small bowl until the sugar is dissolved.",
        "Coat salmon with 1 tablespoon of Teriyaki Sauce in a bowl, then set aside while you cook the noodles. (No need to marinate)",
        "Cook your noodles per the packet directions. Drain, briefly rinse under tap water then set aside.",
        "Cook salmon: Heat 1/2 tablespoon oil in a large non-stick pan over high heat. Cook the salmon for 1 1/2 minutes on each side or until golden, then remove to a plate. Pour any remaining sauce in the skillet over the salmon.",
        "Cook aromatics: Roughly clean the pan with a paper towel then return to the stove, still on high heat. Heat 1 tablespoon of the remaining oil and cook the onion and garlic for 30 seconds. Add Chinese broccoli stems and cook for 1 minute.",
        "Noodles & sauce: Add noodles and half the Sauce. Toss for 2 minutes until the Sauce is absorbed. Add the remaining Sauce and toss to disperse. Then spread the noodles out in the pan, cook for 30 seconds un-disturbed. Repeat again 3 to 4 times (~3 min total) - a trick for nice caramelisation on the noodles (which = flavour!).",
        "Leafy greens: Drizzle the remaining 1/2 tablespoon oil around the side of the pan, then add the Chinese broccoli leaves. Toss for a further 1 1/2 minutes or until the leaves wilt.",
        "Add back salmon: Remove pan from stove. Place salmon on top, break into large chunks then toss through.",
        "Serve: Divide between bowls and serve immediately!"
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/teriyaki-salmon/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:35.508Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "tom-yum-soup-thai-soup",
      "slug": "tom-yum-soup-thai-soup",
      "title": "Tom Yum Soup (Thai Soup)",
      "image": "https://www.recipetineats.com/tachyon/2019/09/Tom-Yum-soup_2.jpg",
      "prepTime": "15 min",
      "cookTime": "20 min",
      "totalTime": "35 min",
      "servings": "2",
      "ingredients": [
        "300g / 10oz whole prawns / shrimp (with heads and shells on (Note 7))",
        "3 cup (750 ml) water",
        "1/2 cup (125 ml) chicken stock/broth (low sodium)",
        "2 stalks of lemongrass (outer layers peeled(Note 1))",
        "1.5 cm / 3/5\" piece of galangal (cut into 4 slices (Note 2))",
        "5 kaffir lime leaves (torn roughly (Note 3))",
        "2 Thai or birdseye chillies (Note 4)",
        "3 garlic cloves",
        "120g / 4oz oyster mushrooms",
        "1 roma tomato (cut into wedges)",
        "1/2 white onion ((medium sized), cut into wedges about 1 cm thick)",
        "1 tsp sugar",
        "3 tbsp fish sauce (Note 5)",
        "3 tbsp lime juice",
        "Coriander/cilantro (for garnish)",
        "1 1/2 tbsp Thai roasted chili sauce (Nam Prik Pa, Note 6)",
        "1/3 cup (75 ml) evaporated milk"
      ],
      "instructions": [
        "Peel the prawns. Place heads and shell in pot, reserve meat.",
        "Use a meat mallet or similar to bash the garlic, chilli and lemongrass so they burst open to release flavour. Add into pot.",
        "Crush kaffir lime leaves with your hands. Add into pot.",
        "Add galangal, stock and water. Bring to simmer on high heat, cover, then reduce to medium and simmer for 10 minutes.",
        "Strain the broth, discard the prawn shells etc, then return broth into same pot over low heat.",
        "Add onions and mushrooms, simmer 3 minutes. Add tomatoes, simmer for 1 minute.",
        "Add prawns, simmer 2 minutes or until just cooked.",
        "Stir in sugar and fish sauce, simmer for 1 minute.",
        "Add lime juice, then taste. Adjust sweet (sugar), salt (fish sauce) and sour (lime) to your taste (trust me, you'll know when you like it!).",
        "Ladle into bowls and serve with fresh coriander and fresh chilli! This is the CLEAR version of Tom Yum.",
        "When you add sugar, also add Thai Chilli Paste and evaporated milk.",
        "Then continue with recipe!",
        "Following Creamy Tom Yum steps but use coconut milk instead of evaporated milk."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/tom-yum-soup/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:45.414Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "korean-beef-bulgogi-rice-bowls-the-easy-way",
      "slug": "korean-beef-bulgogi-rice-bowls-the-easy-way",
      "title": "Korean Beef Bulgogi Rice Bowls - the easy way",
      "image": "https://www.recipetineats.com/tachyon/2025/09/Easy-Korean-Bulgogi-Beef-Bowls_7.jpg",
      "prepTime": "15 min",
      "cookTime": "10 min",
      "totalTime": "25 min",
      "servings": "4",
      "ingredients": [
        "500g / 1 lb beef mince ((ground beef), any fat % you like)",
        "1 tbsp canola oil (or any other plain flavoured oil, + 2 tsp (to wilt baby spinach))",
        "1 tbsp onion (finely grated (~1/4 onion) (Note 1))",
        "3 tbsp red apple (finely grated (skin on is fine, ~1/2 apple) (Note 1))",
        "3 garlic cloves (finely grated)",
        "1 tsp ginger (finely grated)",
        "2 1/2 tbsp soy sauce (- all-purpose or light (Note 2))",
        "1 tbsp sesame oil",
        "1 tbsp mirin (omit for no alcohol (Note 3))",
        "1 tbsp brown sugar",
        "1/8 tsp black pepper",
        "2 tbsp soy sauce (- all-purpose or light (Note 2))",
        "1 tbsp sesame oil",
        "2 tsp brown sugar",
        "2 tsp rice vinegar (or apple cider vinegar)",
        "white rice (medium or short grain, if you can)",
        "4 large handfuls baby spinach (or similar chopped leafy greens - cabbage, kale)",
        "1 large carrot (peeled and julienned or grated using box grater (I use a julienne shredding tool))",
        "1 avocado (mashed)",
        "1/4 cup pickled ginger (I like pink for colour)",
        "1 1/2 cups baby cos / romaine lettuce (torn into bite size pieces)",
        "1 tsp white sesame seeds",
        "1 green onion (finely sliced)"
      ],
      "instructions": [
        "Sauces - Mix the Bulgogi sauce in a bowl, and the rice bowl drizzle sauce in a separate bowl.",
        "Wilt spinach - Heat the 2 teaspoons of oil in a large non-stick pan over high heat. Add half the spinach, toss with tongs until semi wilted (~30 sec), then add the rest. Toss until wilted (~ 1 minute) then remove into a bowl.",
        "Cook Bulgogi beef - Add 1 tablespoon oil to the pan. Still on high heat, add the beef and cook, breaking it up as you go, until you no longer see raw beef.  Add the Bulgogi sauce, then let it simmer rapidly, stirring every now and then, until the sauce is mostly evaporated. Then stir regularly until the beef gets a bit of lovely caramelisation on it, but is still moist from the sauce.",
        "Assemble - Spoon beef over rice, place spinach and carrot. Top with pickled ginger and a dollop of mashed avocado. Tuck lettuce down the side. Sprinkle with sesame seeds and green onion. Serve with sauce for drizzling all over everything before jumbling it all up and digging in!"
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/korean-beef-bulgogi/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:47.230Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "bibimbap",
      "slug": "bibimbap",
      "title": "Bibimbap",
      "image": "https://www.recipetineats.com/tachyon/2019/05/Bibimbap_3.jpg",
      "prepTime": "40 min",
      "cookTime": "30 min",
      "totalTime": "70 min",
      "servings": "4",
      "ingredients": [
        "4 cups cooked white rice (preferably short grain (Note 1))",
        "4 eggs",
        "2 tsp sesame seeds",
        "250 g/8oz beef tenderloin or thick steak (very finely sliced (subs, Note 2))",
        "1/4 green apple (grated using box grater (Note 3))",
        "3 garlic cloves (minced)",
        "1 tbsp soy sauce (light or all purpose (Note 4))",
        "1 tbsp honey (or brown sugar)",
        "2 tsp sesame oil (toasted (Note 9))",
        "2 carrots (large, cut into 5 x 0.5cm/2 x 1/5\" batons)",
        "2 zucchini (large, cut into 5 x 0.5cm/2 x 1/5\" batons)",
        "1 bunch of spinach (cut into 5cm/2\" lengths)",
        "8 dried shiitake mushrooms (large (Note 5))",
        "4 cups bean sprouts",
        "2 tsp garlic (minced (3 cloves))",
        "8 tsp vegetable oil (separated)",
        "1/2 tsp salt",
        "1.5 tsp soy sauce (light or all purpose (Note 4))",
        "1/4 tsp fish sauce (sub soy)",
        "1/4 tsp white sugar",
        "Sesame oil (toasted (Note 9))",
        "4 tbsp gochujang paste (Note 6)",
        "2 tbsp mirin (Note 7)",
        "2 tbsp rice vinegar (Note 8)",
        "1.5 tsp soy sauce (Note 4)",
        "3 tsp white sugar",
        "1 garlic clove (finely grated)",
        "2.5 tsp sesame oil (toasted (Note 9))"
      ],
      "instructions": [
        "Mix ingredients until sugar is dissolved.",
        "Mix the marinade in a bowl, then add beef. Marinate for 30 minutes to overnight.",
        "Heat 2 tsp oil in a large skillet over high heat. Let excess marinade drip off then add beef. Cook for 3 - 4 minutes until cooked and there's some caramelised bits, then remove from skillet.",
        "Keep warm until required or reheat to warm.",
        "Shiitake: Soak mushrooms in a large bowl of boiling water for 30 minutes, or until rehydrated. Drain, squeeze out excess water, then slice.",
        "Carrot and Zucchini salting (optional, Note 10): Place carrot and zucchini in separate bowls, sprinkle each with 1/4 tsp salt, toss, leave for 20 minutes then drain excess liquid.",
        "Get 2 skillets going if you can!",
        "Shiitake: Heat 2 tsp oil oil in a skillet over medium high heat. Cook mushrooms for 2 minutes. Add 1.5 tsp soy, 1/4 tsp sugar, 1/2 tsp of garlic. Stir for 1 minute, then remove.",
        "Carrot: Add 2 tsp oil into the skillet, cook carrot until just tender (5 to 8 minutes), then remove.",
        "Zucchini: Cook as with carrot for 4 minutes.",
        "Spinach: Heat 2 tsp veg with a splash of sesame oil. Saute until starting to wilt. Add 1/2 tsp garlic, and salt to taste, stir, then remove. When cool, squeeze to drain out excess liquid.",
        "Beansprouts: Simmer in water for 5 min or steam in microwave for 3 min until floppy. Drain under cold water, then cool. Squeeze out excess liquid with hands, place in bowl. Mix with 2 tsp sesame oil, 1 tsp garlic, 1/4 tsp fish sauce.",
        "Vegetables can cool, they are meant to be at room temp or slightly warm.",
        "Fry eggs in a skillet to your taste (I like mine with runny yolks).",
        "Place warm rice in bowls.",
        "Top with vegetables and beef, as pictured in post, then lastly, the egg.",
        "Sprinkle with sesame seeds, drizzled with sesame oil. Serve with Bibimbap Sauce!"
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/bibimbap/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:49.634Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "spring-roll-recipe",
      "slug": "spring-roll-recipe",
      "title": "Spring Roll recipe",
      "image": "https://www.recipetineats.com/tachyon/2017/09/Spring-Rolls-4.jpg",
      "prepTime": "20 min",
      "cookTime": "10 min",
      "totalTime": "30 min",
      "servings": "15",
      "ingredients": [
        "1 tbsp oil",
        "2 garlic cloves (finely chopped or minced)",
        "400 g / 13 oz pork mince ((ground pork), or chicken or turkey)",
        "6 dried shiitake mushrooms soaked in boiling water OR 8 fresh (Note 1)",
        "1 1/2 cups shredded carrot (1 large or 2 small)",
        "1 1/2 cups (heaped) bean sprouts",
        "1 1/2 cups (packed) shredded green cabbage (any type is fine)",
        "1 tsp cornflour / cornstarch",
        "1 1/2 tbsp Oyster Sauce",
        "2 tsp soy sauce (light or all purpose is best, dark is also ok)",
        "15 – 20 spring roll wrappers, defrosted (21.5 cm / 8” squares) OR 35 - 40 small spring roll wrappers (Note 2), or Egg Roll wrappers to make Egg Rolls (Note 6)",
        "2 tsp cornflour (for sealing rolls)",
        "1 tbsp water (for sealing rolls)",
        "Oil for frying (I use vegetable) OR oil spray for baking (I use canola)",
        "2 tsp cornflour/ cornstarch",
        "2 tbsp water",
        "½ cup apple cider vinegar",
        "1/3 cup brown sugar (adjust to taste)",
        "2 tbsp tomato ketchup",
        "2 tsp soy sauce"
      ],
      "instructions": [
        "Heat oil in a skillet or wok over high heat. Add garlic, stir quickly, then add pork. Cook, breaking it up as you go, until it turns white.",
        "Add carrot, bean sprouts, cabbage and mushrooms. Cook for 3 minutes or until vegetables are wilted. Add cornflour, soy sauce and Oyster sauce, cook for 1 minute until the liquid is gone. The Filling should not be watery, it should be kind of sticky (watery filling = soggy spring rolls = ? ).",
        "Cool Filling (super speedy: spread on tray, refrigerate 5 minutes). (Hot filling = spring rolls burst open = ? )",
        "Mix cornflour and water in a small bowl (for sealing the rolls).",
        "Carefully peel off one spring roll wrapper, keep the others covered under a damp tea towel.",
        "Place the wrapper with the SMOOTH SIDE DOWN (Note 3) in a diamond position. Place a very heaped dessert spoon of filling on the bottom. Roll up halfway, fold sides in, then finish rolling. Use cornflour sludge to seal. (Watch VIDEO below). They should be about 12 cm / 5\" long, 2.5cm / 1\" wide once wrapped.",
        "Pour enough oil in a wok or large saucepan (Note 4) so it is double the height of the spring rolls. Heat on medium high until hot - stick a bamboo chopstick or wooden spoon handle in, if rapid bubbles appear, then it's hot enough.",
        "Carefully place spring rolls in the oil (about 4 - 5 at a time) and cook, turning occasionally, until deep golden - around 1 1/2 - 2 minutes. Transfer to paper towels to drain.",
        "Repeat with remaining spring rolls. Serve while hot with Sweet and Sour Sauce!",
        "Place spring rolls on a rack and place the rack on a tray. Spray very generously with oil all over (use canola or other natural oil). Bake at 200C/400F (standard) or 180C/350F (fan / convection) for 20 to 25 minutes until golden and crispy - no need to turn.",
        "Combine ingredients in a small saucepan over medium heat. Bring to simmer, stirring regularly, then simmer until it thickens to taste (about 3 - 5 minutes)."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/spring-rolls/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:30:53.004Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "dan-dan-noodles",
      "slug": "dan-dan-noodles",
      "title": "Dan Dan Noodles",
      "image": "https://www.recipetineats.com/tachyon/2020/02/Dan-Dan-Noodles_4-2.jpg",
      "prepTime": "15 min",
      "cookTime": "15 min",
      "totalTime": null,
      "servings": "4",
      "ingredients": [
        "2 tbsp Chinese sesame paste (sub tahini, Note 1)",
        "1.5 tbsp Chinese chilli paste in oil (adjust spiciness (Note 2))",
        "4 tbsp light soy sauce (Note 3)",
        "2 garlic cloves (minced)",
        "3 tsp white sugar",
        "1/2 tsp Chinese five spice powder (Note 4)",
        "1 tsp Sichuan pepper powder (preferably freshly ground (Note 5))",
        "3 tbsp (or more!) chilli oil (preferably Chinese (Note 6))",
        "3/4 cup (185ml) chicken broth/stock (hot, low sodium)",
        "2 tsp Hoisin sauce",
        "1 tsp dark soy sauce (Note 7)",
        "1 tbsp Chinese cooking wine (sub 2 tbsp extra chicken stock)",
        "1/2 tsp Chinese five spice powder (Note 4)",
        "1 tbsp vegetable oil",
        "250g/ 8oz pork mince (ground pork)",
        "1 tsp vegetable oil",
        "30g (1/4 cup) Sui Mi Ya Cai (preserved mustard greens) (finely chopped (Note 8))",
        "500g/1lb white fresh noodles (medium thickness (Note 9))",
        "16 choy sum stems (cut into 15cm pieces)",
        "2 green onions (finely sliced)",
        "1 tbsp peanuts (finely chopped (optional))"
      ],
      "instructions": [
        "Mix all ingredients except oil and chicken stock. Then gently stir in oil and stock - oil should be sitting on surface. Set aside.",
        "Mix together hoisin, soy, Chinese wine and five spice (\"Sauce\").",
        "Heat oil in a skillet or wok over high heat. Add pork and cook, breaking it up as you, until it changes from pink to white. Add Sauce and cook for 1 minute, then transfer into a bowl.",
        "Return skillet to stove, reduce to medium heat. Add oil into middle of skillet.",
        "Add Sui mi ya cai and stir for 30 seconds, just to warm through. Set aside.",
        "Bring a large pot of water to the boil. Cook noodles per packet directions.",
        "Add choi sum for last 1 minute of cooking.",
        "Drain.",
        "Ladle 1/4 of Dan Dan Sauce into a bowl. Pile in noodles, top with pork and Sui mi ya cai. Place choi sum on side.",
        "Sprinkle with peanuts and green onions and serve.",
        "To eat, mix it all up to coat the noodles well with Sauce, then devour!"
      ],
      "tags": [
        "asian",
        "chinese"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/dan-dan-noodles/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:35:04.721Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "satay-chicken-curry-malaysian",
      "slug": "satay-chicken-curry-malaysian",
      "title": "Satay Chicken Curry (Malaysian)",
      "image": "https://www.recipetineats.com/tachyon/2016/05/Satay-Chicken-Curry_SQ.jpg",
      "prepTime": "20 min",
      "cookTime": "25 min",
      "totalTime": null,
      "servings": "5",
      "ingredients": [
        "1 1/2 tsp coriander",
        "1 1/2 tsp cumin powder",
        "1 1/2 tsp tumeric",
        "1 1/2 tsp paprika (sweet or normal, not smoked or spicy)",
        "1 1/4 tsp chilli powder (adjust to taste (not US \"Chili Powder\", Note 1))",
        "3 1/2 tsp curry powder (not HOT (any, Malaysian, generic, Clives of India, Keens))",
        "1 1/4 tsp salt (cooking / kosher (or 1 tsp table salt))",
        "2 tsp white sugar",
        "750g / 1.5 lb chicken thigh fillets (cut into bite size pieces (Note 2))",
        "1/2 onion ((brown, white or yellow), grated)",
        "2 tbsp oil (separated)",
        "3 - 6 birds eye chillies or other small hot red chillies (finely chopped (Note 3))",
        "1/4 cup onion ((brown, white or yellow), finely diced (~ 1/4 onion))",
        "4 garlic cloves (minced)",
        "1 cup chicken broth / stock",
        "3/4 cup peanuts, roasted unsalted, (chopped, separated)",
        "2 tsp kecap manis (Note 4)",
        "3 tsp dark soy sauce (Note 5)",
        "400g / 14oz coconut milk (preferably full fat but light will be ok)",
        "2 tbsp peanut butter (pure best but spread ok too, crunchy or smooth)",
        "2 tbsp lime juice (to taste)",
        "3 makrut lime leaves ((formerly kaffir lime leaves) (Note 6))",
        "1 lemongrass stalk (white part only, smashed to burst open (Note 7))",
        "Peanuts (chopped)",
        "Cilantro / coriander leaves",
        "Fresh chilli, finely chopped"
      ],
      "instructions": [
        "Combine Satay Seasoning ingredients in a small bowl.",
        "Marinate - Combine chicken with 3 1/2 TABLESPOONS Satay Seasoning and onion in a bowl. Marinate for at least 3 hours, preferably overnight, minimum 20 minutes (Note 6)",
        "Cook - Heat 1 tbsp oil in a non stick skillet over high heat (Note 7). Cook chicken in 2 batches until browned all over but still raw inside. Transfer to bowl, cover and keep warm.",
        "Saute aromatics - Using the same skillet, turn heat down to medium and heat 1 tbsp oil. Add chill, onion and garlic cloves. Sauté until onion is translucent - around 2 minutes.",
        "Satay Seasoning - Add remaining Satay Seasoning and cook for 1 minute.",
        "Blitz - Transfer to a blender or small food processor (I use a Nutribullet). Add chicken stock and 1/2 cup of the peanuts (rest gets added later). Puree until pretty smooth - some peanut chunks can remain. Pour mixture back into the skillet.",
        "Add remaining ingredients into sauce - Add remaining 1/4 cup peanuts, kecap manis, dark soy sauce, coconut milk and peanut butter. Stir to combine.",
        "Add lime leaf or lemongrass - Crush makrut lime leaf in hand a bit (to break leaf to release the flavour). Add lime leaf OR lemongrass and chicken to sauce.",
        "Simmer - Bring to simmer, turn heat down to medium low and simmer for 15 minutes until thickened.",
        "Serve - Add lime juice to taste. Serve with rice (jasmine, white rice or brown rice). Garnish with peanuts, cilantro/coriander leaves and more chilli if desired. See Note 9 for suggested sides."
      ],
      "tags": [
        "asian",
        "chinese"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/chicken-satay/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:35:24.628Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "quick-beef-stir-fry",
      "slug": "quick-beef-stir-fry",
      "title": "Quick Beef Stir-Fry",
      "image": "https://www.allrecipes.com/thmb/7N-Xq1XMMJw8G0KJv2e0ETUYB2I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/228823-quick-beef-stir-fry-DDMFS-4x3-1f79b031d3134f02ac27d79e967dfef5.jpg",
      "prepTime": "15 min",
      "cookTime": "10 min",
      "totalTime": "25 min",
      "servings": "4",
      "ingredients": [
        "2 tablespoons vegetable oil",
        "1 pound beef sirloin, cut into 2-inch strips",
        "1.5 cups fresh broccoli florets",
        "1 red bell pepper, cut into matchsticks",
        "2 carrots, thinly sliced",
        "1 green onion, chopped",
        "1 teaspoon minced garlic",
        "2 tablespoons soy sauce",
        "2 tablespoons sesame seeds, toasted"
      ],
      "instructions": [
        "Gather all ingredients.",
        "Heat vegetable oil in a large wok or skillet over medium-high heat; add beef and stir-fry until browned, 3 to 4 minutes.",
        "Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok; stir-fry vegetables for 2 minutes.",
        "Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes.",
        "Serve hot and enjoy!"
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "allrecipes.com",
        "url": "https://www.allrecipes.com/recipe/228823/quick-beef-stir-fry/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:39:48.394Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "easy-pad-thai",
      "slug": "easy-pad-thai",
      "title": "Easy pad Thai",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1900_12-19b9a16.jpg?resize=440,400",
      "prepTime": null,
      "cookTime": null,
      "totalTime": "30 min",
      "servings": "2",
      "ingredients": [
        "125g (half a 250g pack) rice noodles",
        "3 tbsp lime juice about 2 limes",
        "½ tsp cayenne pepper",
        "2 tsp light muscovado sugar",
        "2 tbsp fish sauce (nam pla)",
        "2 tbsp vegetable oil",
        "200g cooked and peeled tiger prawn tails left on",
        "4 spring onions sliced",
        "140g beansprout",
        "25g salted peanut finely chopped",
        "a small handful of coriander leaves",
        "1 or 2 lime cut into wedges",
        "sweet chilli sauce"
      ],
      "instructions": [
        "Put the noodles in a large heatproof bowl, pour boiling water over them and leave for 4 minutes, then drain and refresh under cold running water.",
        "Put the lime juice, cayenne, sugar and fish sauce in a bowl and mix well. Have all the other ingredients ready by the cooker.",
        "Heat the oil and fry the prawns until warmed through. Add the spring onions and noodles and toss around. Tip in the lime juice mixture, then stir in the beansprouts and half the peanuts and coriander. Cook for 1 minute until everything is heated through.",
        "Pile into a large dish, scatter with the rest of the peanuts and coriander, and serve with lime wedges and sweet chilli sauce."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/easy-pad-thai"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:43:27.147Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "healthy-chicken-katsu-curry",
      "slug": "healthy-chicken-katsu-curry",
      "title": "Healthy chicken katsu curry",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-katsu-curry-d339012.jpg?resize=430,400",
      "prepTime": "20 min",
      "cookTime": "35 min",
      "totalTime": "55 min",
      "servings": "2",
      "ingredients": [
        "25g flaked almonds",
        "1 tsp cold-pressed rapeseed oil",
        "2 boneless, skinless chicken breasts (about 300g total)",
        "lime wedges, for squeezing over",
        "2 tsp cold-pressed rapeseed oil",
        "1 medium onion roughly chopped",
        "2 garlic cloves finely chopped",
        "thumb-sized piece ginger peeled and finely chopped",
        "2 tsp medium curry powder",
        "1 star anise",
        "¼ tsp ground turmeric",
        "1 tbsp plain wholemeal flour",
        "100g long-grain brown rice",
        "2 spring onions finely sliced (include the green part)",
        "1 medium carrot peeled into long strips with a vegetable peeler",
        "⅓ cucumber peeled into long strips with a vegetable peeler",
        "1 small red chilli finely chopped (deseeded if you don't like it too hot)",
        "juice ½ lime",
        "small handful mint leaves",
        "small handful coriander leaves"
      ],
      "instructions": [
        "Heat oven to 220C/200C fan/gas 7, or if using an air-fryer, heat to 180C for 4 mins. Cook the brown rice in plenty of boiling water for 35 mins or until tender.",
        "Crush the almonds using a pestle and mortar, or blitz in a food processor until finely chopped, then sprinkle over a plate. Grease a small baking tray with a little of the oil if baking in the oven. Brush the chicken on both sides with the remaining oil and season well. Coat the chicken with the nuts and place on the tray. Press any remaining nuts from the plate onto each breast. Bake for 20 mins in the oven, or 18-20 mins in the air-fryer until browned and cooked through. Rest for 4-5 mins on the tray, then slice thickly.",
        "Meanwhile, make the sauce. Heat the oil in a medium non-stick saucepan and add the onion, garlic and ginger. Loosely cover the pan and fry gently for 8 mins or until softened and lightly browned, stirring occasionally. Remove the lid for the final 2 mins, and don’t let the garlic burn.",
        "Stir in the curry powder, star anise, turmeric and a good grinding of black pepper. Cook for a few secs more, stirring. Sprinkle over the flour and stir well. Gradually add 400ml water to the pan, stirring constantly.",
        "Bring the sauce to a simmer and cook for 10 mins, stirring occasionally. If it begins to splutter, cover loosely with a lid. Remove the pan from the heat and blitz the sauce with a stick blender until smooth. Adjust the seasoning to taste. Keep warm.",
        "Once the rice is tender, add the spring onions and cook for 1 min more. Drain well, then leave to stand for a few mins while you make the salad. Toss the carrot and cucumber with the chilli, lime juice and herbs.",
        "Divide the sliced chicken between two plates, pour over the sauce and serve with the rice, salad and lime wedges for squeezing over."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/chicken-katsu-curry"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:43:28.933Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "crispy-chilli-beef",
      "slug": "crispy-chilli-beef",
      "title": "Crispy chilli beef",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1176635_11-b391f28.jpg?resize=440,400",
      "prepTime": "25 min",
      "cookTime": "15 min",
      "totalTime": "40 min",
      "servings": "3",
      "ingredients": [
        "350g thin-cut minute steak very thinly sliced into strips",
        "3 tbsp cornflour",
        "2 tsp Chinese five-spice powder",
        "100ml vegetable oil",
        "1 red pepper thinly sliced",
        "1 red chilli thinly sliced",
        "4 spring onions sliced, green and white parts separated",
        "2 garlic cloves crushed",
        "thumb-sized piece ginger cut into matchsticks",
        "4 tbsp rice wine vinegar or white wine vinegar",
        "1 tbsp soy sauce",
        "2 tbsp sweet chilli sauce",
        "2 tbsp tomato ketchup",
        "cooked noodles to serve (optional)",
        "prawn crackers to serve (optional)"
      ],
      "instructions": [
        "Put 350g thin-cut minute steak strips in a bowl and toss in 3 tbsp cornflour and 2 tsp Chinese five-spice powder.",
        "Heat 100ml vegetable oil in a wok or large frying pan until hot, then add the beef and fry until golden and crisp.",
        "Scoop out the beef and drain on kitchen paper. Pour away all but 1 tbsp oil.",
        "Add 1 thinly sliced red pepper, ½ thinly sliced red chilli, sliced white ends of 4 spring onions, 2 crushed garlic cloves and thumb-sized piece ginger, cut into matchsticks, to the pan. Stir-fry for 3 mins to soften, but don’t let the garlic and ginger burn.",
        "Mix the 4 tbsp rice wine vinegar or white wine vinegar, 1 tbsp soy sauce, 2 tbsp sweet chilli sauce and 2 tbsp tomato ketchup in a jug with 2 tbsp water, then pour over the veg.",
        "Bubble for 2 mins, then add the beef back to the pan and toss well to coat.",
        "Serve the beef on noodles with prawn crackers, if you like, scattered with the remaining ½ sliced red chilli and sliced green parts of the spring onions."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/crispy-chilli-beef"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:45:55.223Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "sweet-sour-chicken",
      "slug": "sweet-sour-chicken",
      "title": "Sweet & sour chicken",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2010/02/Sweet-and-sour-chicken-bbd3783.jpg?resize=768,698",
      "prepTime": "20 min",
      "cookTime": "45 min",
      "totalTime": "1 hr 5 min",
      "servings": "4",
      "ingredients": [
        "sunflower or vegetable oil for frying",
        "100ml soda water chilled",
        "140g self-raising flour",
        "25g cornflour",
        "4 skinless, boneless chicken breasts cut into chunks",
        "spring onions finely shredded, to serve",
        "1 red pepper deseeded and chopped into chunks",
        "3 red chillies 1 cut into chunks, 2 halved and deseeded",
        "425g can pineapple chunks, drained and juice reserved",
        "4 star anise",
        "50g tamarind paste",
        "100g caster sugar",
        "100ml rice wine vinegar or Chinese vinegar"
      ],
      "instructions": [
        "For the sauce, put the red pepper, chunks of chilli and pineapple juice in a pan and bring to the boil. Cover and cook for 10 mins, then purée in a food processor.",
        "Return to the pan with the pineapple chunks, chilli halves, star anise, tamarind, sugar and vinegar. Gently simmer for 20-30 mins until reduced and sticky. Keep warm, or reheat to serve.",
        "Fill a large pan 1cm deep with oil and heat until shimmering. Whisk the soda water and 100ml cold water into the self-raising flour with a little salt. Stir the batter well.",
        "Tip the cornflour onto a plate, line a tray with kitchen paper and turn on the oven to low. Dust the chicken with cornflour, then dip into the batter.",
        "One at a time, lower into the hot oil (about 5-6 every batch). Turn up the heat to keep the chicken frying, if needed, and cook for 5-6 mins, turning once.",
        "When cooked, drain on the tray, and keep warm in the oven. Repeat with the remaining chicken.",
        "Stack onto a plate with the warm sauce on the side, and scatter with shredded spring onions."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/sweet-sour-chicken"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:45:56.900Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "chicken-noodle-soup",
      "slug": "chicken-noodle-soup",
      "title": "Chicken noodle soup",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1035613_10-0e544b7.jpg?resize=500,454",
      "prepTime": "10 min",
      "cookTime": "30 min",
      "totalTime": "40 min",
      "servings": "2",
      "ingredients": [
        "900ml chicken or vegetable stock (or Miso soup mix)",
        "1 boneless, skinless chicken breast (about 175g)",
        "1 tsp chopped fresh ginger",
        "1 garlic clove finely chopped",
        "50g rice or wheat noodles",
        "2 tbsp sweetcorn canned or frozen",
        "2-3 mushrooms thinly sliced",
        "2 spring onions shredded",
        "2 tsp soy sauce plus extra for serving",
        "mint or basil leaves and a little shredded chilli (optional), to serve"
      ],
      "instructions": [
        "Pour the stock into a pan and add the chicken breast, ginger and garlic. Bring to the boil, then reduce the heat, partly cover and simmer for 20 mins, until the chicken is tender.",
        "Put the chicken on a board and shred into bite-size pieces using a couple of forks. Return the chicken to the stock with the noodles, sweetcorn, mushrooms, spring onion and soy sauce. Simmer for 3-4 mins until the noodles are tender.",
        "Ladle into two bowls and scatter over the remaining spring onion, mint or basil leaves and chilli, if using. Serve with extra soy sauce."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/chicken-noodle-soup"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:45:58.619Z",
      "theme": "Asian Inspired"
    },
    {
      "id": "miso-soup",
      "slug": "miso-soup",
      "title": "Miso soup",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/miso_soup-e06ed98.jpg?resize=440,400",
      "prepTime": "10 min",
      "cookTime": "5 min",
      "totalTime": "15 min",
      "servings": "4",
      "ingredients": [
        "5g dried wakame seaweed",
        "1l dashi (shop bought or see tip)",
        "200g fresh silken tofu or firm if you prefer, cut into 1cm cubes",
        "2 tbsp white miso paste",
        "3 tbsp red miso paste",
        "spring onion finely chopped, to serve"
      ],
      "instructions": [
        "Put the wakame in a small bowl and cover with cold water, then leave it for 5 mins until the leaves have fully expanded.",
        "Make the dashi (see tip below) or heat until it reaches a rolling boil. Add the tofu and cook for 1 min before adding the seaweed.",
        "Reduce the heat. Put both types of miso in a ladle or strainer and dip it into the pot. Slowly loosen up the miso with a spoon inside the ladle or strainer; the paste will slowly melt into the dashi. Once all the miso is dissolved into the soup, turn off the heat immediately. Sprinkle with chopped spring onions to add colour and fragrance."
      ],
      "tags": [
        "asian"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/miso-soup"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:46:02.630Z",
      "theme": "Asian Inspired"
    }
  ]
}