{
  "theme": {
    "slug": "quick-weeknight-dinners",
    "name": "Quick Weeknight Dinners",
    "description": "Fast, easy meals ready in 30 minutes or less with simple ingredients"
  },
  "metadata": {
    "recipeCount": 18,
    "lastUpdated": "2026-01-18T06:49:07.312Z"
  },
  "recipes": [
    {
      "id": "fried-rice",
      "slug": "fried-rice",
      "title": "Fried Rice",
      "image": "https://www.recipetineats.com/tachyon/2018/03/Egg-Fried-Rice_5-1.jpg",
      "prepTime": "5 min",
      "cookTime": "10 min",
      "totalTime": "15 min",
      "servings": "2",
      "ingredients": [
        "2 tbsp oil",
        "1/2 onion (finely chopped)",
        "2 garlic cloves (minced)",
        "120 g/4 oz bacon (chopped (optional, or use ham))",
        "1 - 1 1/2 cups diced vegetables (frozen or fresh (Note 1))",
        "2 cups (packed) cooked day old white rice (refrigerated or frozen defrosted, Note 2)",
        "3 eggs, whisked",
        "3/4 cup green onions ((shallots / scallions) sliced)",
        "1 tbsp Chinese cooking wine ((sub Mirin, cooking sake or dry sherry) (Note 4))",
        "1 tbsp Oyster Sauce",
        "1 tbsp light soy sauce ((or all purpose) (Note 5))",
        "1 tsp sesame oil (optional)",
        "1/4 tsp white pepper"
      ],
      "instructions": [
        "Heat oil - Heat about 1 1/2 tbsp oil in a wok or 2 tbsp oil in a skillet over high heat until smoking.",
        "Add onion, garlic and bacon. Cook until bacon is light golden - about 1 1/2 minutes.",
        "Add vegetables (still frozen is fine). Cook for 2 minutes so they defrost and water evaporates.",
        "Add rice and Sauce ingredients. Cook for 1 1/2 minutes until liquid evaporates.",
        "Scramble egg - Shove rice to the side of the wok / skillet. Add 1/2 tbsp oil into the cleared space, shift wok so the heat is centred over the cleared space. Pour in egg then scramble - cook it through properly, don't \"soft scramble\".",
        "Serve - Add green onion then stir the egg into the rice. Remove from heat and serve immediately!"
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy"
      ],
      "source": {
        "name": "Recipetineats",
        "url": "https://www.recipetineats.com/egg-fried-rice/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:33.418692Z"
    },
    {
      "id": "chicken-fried-rice",
      "slug": "chicken-fried-rice",
      "title": "Chicken Fried Rice",
      "image": "https://www.recipetineats.com/tachyon/2019/09/Chicken-fried-rice-copy.jpg",
      "prepTime": "10 min",
      "cookTime": "10 min",
      "totalTime": "20 min",
      "servings": "4",
      "ingredients": [
        "2 tbsp oil (peanut, vegetable or canola)",
        "2 eggs (lightly whisked)",
        "150g (5oz) chicken breast (finely sliced into small pieces)",
        "2 garlic cloves (minced)",
        "1/2 onion (finely chopped)",
        "120g (4oz) bacon (excess fat trimmed, chopped (Note 1))",
        "1 small carrot* (peeled and diced 0.75cm / 1/3\")",
        "1/2 cup frozen corn* (or can or fresh)",
        "1/2 cup frozen peas*",
        "2 cups (packed) cooked white rice (day old (Note 2))",
        "3/4 cup green onions (finely sliced)",
        "2.5 tbsp Chinese cooking wine or Mirin (Note 3)",
        "1 tbsp oyster sauce (Note 4)",
        "3 tbsp light soy sauce (Note 5)",
        "1/2 tsp sesame oil (optional)",
        "1/4 tsp white pepper (optional)"
      ],
      "instructions": [
        "Sauce & chicken: Mix Sauce in a bowl. Pour 2 tsp over chicken, toss to coat, then set aside for 10 minutes.",
        "Egg: Heat 1 tbsp oil in a wok or skillet over medium heat. Add egg and scramble until just cooked (still a touch wet) then remove.",
        "Fried Rice: Turn heat up to high, add remaining 1/2 tbsp oil and bacon into same skillet. Cook for 1 minute or so until fat starts to melt, then add onion and garlic.",
        "Cook until bacon is light golden - about 1 1/2 minutes.",
        "Add vegetables (still frozen is fine). Cook for 1 minute.",
        "Add chicken and cook until it changes from pink to white - about 1 1/2 minutes.",
        "Add rice and Sauce ingredients. Cook for 1 1/2 minutes, stirring consantly.",
        "Add egg and green onion, toss through to disperse then remove from heat.",
        "Serve immediately!"
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "poultry"
      ],
      "source": {
        "name": "Recipetineats",
        "url": "https://www.recipetineats.com/chicken-fried-rice/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:36.589340Z"
    },
    {
      "id": "honey-garlic-chicken-breast",
      "slug": "honey-garlic-chicken-breast",
      "title": "Honey Garlic Chicken Breast",
      "image": "https://www.recipetineats.com/tachyon/2020/02/Honey-Garlic-Chicken-Breast_5-SQ.jpg",
      "prepTime": "4 min",
      "cookTime": "8 min",
      "totalTime": "12 min",
      "servings": "4",
      "ingredients": [
        "500g / 1 lb chicken breast (boneless and skinless (2 pieces))",
        "Salt and pepper",
        "1/4 cup flour (Note 1)",
        "3 1/2 tbsp (50g) unsalted butter (or 2 1/2 tbsp olive oil)",
        "2 garlic cloves (minced)",
        "1 1/2 tbsp apple cider vinegar (or white or other clear vinegar)",
        "1 tbsp soy sauce (light or all purpose (Note 2))",
        "1/3 cup honey (or maple syrup)"
      ],
      "instructions": [
        "Cut the breasts in half horizontally to create 4 steaks in total. Sprinkle each side with salt and pepper.",
        "Place flour in a shallow dish. Coat chicken in flour and shake off excess.",
        "Melt most of the butter in a large skillet over high heat - hold back about 1 tsp for later.",
        "Place chicken in skillet and cook for 2 - 3 minutes until golden. Turn and cook the other side for 1 minute.",
        "Turn heat down slightly to medium high.",
        "Make a bit of room in the pan and add garlic and top with remaining dab of butter. Stir garlic briefly once butter melts.",
        "Add vinegar, soy sauce and honey. Stir / shake pan to combine. Bring sauce to simmer, then simmer for 1 minute or until slightly thickened.",
        "Turn chicken to coat in sauce. If the sauce gets too thick, add a touch of water and stir.",
        "Remove from stove immediately. Place chicken on plates and drizzle over remaining sauce."
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "poultry"
      ],
      "source": {
        "name": "Recipetineats",
        "url": "https://www.recipetineats.com/honey-garlic-chicken/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:39.903951Z"
    },
    {
      "id": "teriyaki-chicken-with-homemade-teriyaki-sauce",
      "slug": "teriyaki-chicken-with-homemade-teriyaki-sauce",
      "title": "Teriyaki Chicken (With Homemade Teriyaki Sauce)",
      "image": "https://www.recipetineats.com/tachyon/2014/07/Teriyaki-Chicken-2-1.jpg",
      "prepTime": "2 min",
      "cookTime": "13 min",
      "totalTime": "15 min",
      "servings": "4",
      "ingredients": [
        "4 tbsp Teriyaki Sauce Marinade",
        "4 chicken thigh fillets (skinless and boneless (about 5oz/150g each))",
        "1 tbsp oil",
        "2 tbsp soy sauce",
        "2 tbsp mirin",
        "2 tbsp Japanese cooking wine (sake)",
        "2 tbsp water"
      ],
      "instructions": [
        "Combine the 4 ingredients in a small saucepan over high heat.",
        "Bring to boil, then turn heat down and simmer until it reduces by half - it should only take 5 minutes or so. The consistency should be like a light syrup. Keep your eye on it - it will start to thicken suddenly!",
        "Bring to room temperature before using.",
        "Combine the Marinade with the chicken and marinate for at least 20 minutes, preferably overnight.",
        "Remove chicken from Marinade but do not discard the Marinade liquid.",
        "Heat oil in non stick pan over medium to medium-high heat. You don't want it too hot because otherwise the sugar in the Marinade will burn before the inside is cooked.",
        "Place the chicken in the pan and cook the first side for around 3 minutes, checking to ensure the skin isn't cooking too quickly. If it is, remove pan from heat and turn the heat down, and add about 2 to 4 tbsp of water to the pan then return to the stovetop. The water slows down the searing process on the skin while still allowing the chicken to cook on the inside.",
        "Turn chicken over and cook the other side. Just before the chicken is finished cooking, add 2 tbsp of water to the pan and and swirl around and mix with the marinade that has come off the chicken. This will make a dark glossy \"sauce\". Move the chicken around in the pan to coat with this sauce.",
        "The Marinade is a strong flavour so you shouldn't need any extra sauce. But if you do want more, add equal parts of Teriyaki Sauce and water to the pan and allow to come to a simmer and let it cook until the desired consistency.",
        "Serve with rice."
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "poultry"
      ],
      "source": {
        "name": "Recipetineats",
        "url": "https://www.recipetineats.com/teriyaki-chicken/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:43.235389Z"
    },
    {
      "id": "one-pot-veggie-pasta",
      "slug": "one-pot-veggie-pasta",
      "title": "One Pot Veggie Pasta",
      "image": "https://www.budgetbytes.com/wp-content/uploads/2021/10/One-Pot-Veggie-Pasta-bowl.jpg",
      "prepTime": "10 min",
      "cookTime": "20 min",
      "totalTime": "30 min",
      "servings": "4",
      "ingredients": [
        "2 cloves garlic ($0.16)",
        "1 yellow onion ($0.28)",
        "2 carrots ($0.16)",
        "2 Tbsp olive oil ($0.32)",
        "8 oz. mushrooms ($1.49)",
        "1 zucchini ($0.90)",
        "1 red bell pepper ($1.50)",
        "1/2 lb. rotini (not cooked) ($0.50)",
        "1/2 tsp dried basil ($0.05)",
        "1/2 tsp dried oregano ($0.05)",
        "2 cups vegetable broth ($0.26)",
        "24 oz. pasta sauce ($1.49)",
        "4 oz. mozzarella, shredded (optional) ($0.83)"
      ],
      "instructions": [
        "Mince the garlic, dice the onion, and slice the carrots. Add the garlic, onion, and carrots to a large pot with the olive oil. Sauté over medium heat until the onions are soft and translucent.",
        "While the vegetables are sautéing, slice the mushrooms. Once sliced, add them to the pot with the other vegetables and continue sautéing.",
        "While the rest of the vegetables are sautéing, dice the zucchini and bell pepper.",
        "Once the bell pepper and zucchini are diced, add them to the pot along with the rotini, basil, oregano, and vegetable broth. Stir to combine. It's okay if the broth doesn't fully submerge the pasta.",
        "Place a lid on the pot, turn the heat up to medium-high, and allow the broth to come up to a boil.",
        "Once the broth reaches a full boil, give the pasta a quick stir, replace the lid, then turn the heat down to medium-low. Let the pasta simmer over medium-low, stirring occasionally and always replacing the lid, for about 10 minutes, or until the pasta is tender.",
        "Once the pasta is tender, add the pasta sauce to the pot and stir to combine. Top with the shredded cheese then place the lid back on the pot. Let the pasta heat for a few minutes, or just until the cheese is melted. Serve hot!"
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "vegetarian",
        "pasta"
      ],
      "source": {
        "name": "Budgetbytes",
        "url": "https://www.budgetbytes.com/one-pot-veggie-pasta/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:46.417126Z"
    },
    {
      "id": "creamy-tomato-and-spinach-pasta",
      "slug": "creamy-tomato-and-spinach-pasta",
      "title": "Creamy Tomato and Spinach Pasta",
      "image": "https://www.budgetbytes.com/wp-content/uploads/2020/05/CreamyTomatoSpinachPasta_OverheadPlated.jpg",
      "prepTime": "5 min",
      "cookTime": "20 min",
      "totalTime": "25 min",
      "servings": "4",
      "ingredients": [
        "½ lb penne pasta ($0.49)",
        "1 yellow onion (small dice, 340g, 1.5 cups, $0.78)",
        "2 cloves garlic (minced, 1 Tbsp, $0.12)",
        "1 Tbsp olive oil ($0.18)",
        "14.5 oz. diced tomatoes (1 can, $0.96)",
        "½ tsp dried oregano ($0.12)",
        "½ tsp dried basil ($0.13)",
        "⅛ tsp crushed red pepper ($0.02)",
        "½ tsp salt ($0.02)",
        "½ tsp freshly cracked black pepper ($0.08)",
        "2 Tbsp tomato paste ($0.14)",
        "½ cup water ($0.00)",
        "2 oz cream cheese ($0.46)",
        "¼ cup grated Parmesan (30g, $0.51)",
        "4 oz fresh spinach ($0.79)"
      ],
      "instructions": [
        "Gather and prepare all ingredients.",
        "Bring a large pot of water to a boil over high heat. Add the pasta and continue to boil until tender (7-10 minutes). Drain the pasta in a colander.",
        "While the pasta is cooking, prepare the creamy tomato sauce. Dice the onion and mince the garlic. Add the onion, garlic, and olive oil to a large skillet and sauté over medium heat until the onions are soft and translucent (3-5 minutes).",
        "Add the diced tomatoes (with juices), oregano, basil, crushed red pepper, salt, and some freshly cracked pepper to the skillet. Stir to combine. Add the tomato paste and a 1/2 cup of water to the skillet and stir until the tomato paste has mixed into the sauce.",
        "Turn the heat down to low. Cut the cream cheese into a few pieces and then add them to the skillet with the tomato sauce. Use a whisk to stir the sauce until the cream cheese has fully melted and the sauce is creamy. Add the Parmesan to the skillet and stir until it is melted into the sauce.",
        "Add the fresh spinach to the skillet and gently stir it into the sauce until it has wilted (2-3 minutes). Add the pasta and stir until it is well coated in the creamy tomato sauce. Taste and adjust the salt and pepper as needed. Serve warm."
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "vegetarian",
        "pasta"
      ],
      "source": {
        "name": "Budgetbytes",
        "url": "https://www.budgetbytes.com/creamy-tomato-spinach-pasta/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:49.590997Z"
    },
    {
      "id": "beef-stroganoff",
      "slug": "beef-stroganoff",
      "title": "Beef Stroganoff",
      "image": "https://www.budgetbytes.com/wp-content/uploads/2014/02/One-Pot-Beef-and-Mushroom-Stroganoff-done.jpg",
      "prepTime": "10 min",
      "cookTime": "20 min",
      "totalTime": "30 min",
      "servings": "4",
      "ingredients": [
        "2 cloves garlic ($0.16)",
        "2 Tbsp butter ($0.22)",
        "½ lb. ground beef ($2.50*)",
        "8 oz. mushrooms ($1.49)",
        "⅛ tsp black pepper (freshly cracked, $0.01)",
        "2 cups beef broth ($0.26**)",
        "1 Tbsp Worcestershire sauce ($0.03)",
        "½ tsp Dijon mustard ($0.02)",
        "8 oz. wide egg noodles ($0.60)",
        "⅓ cup sour cream ($0.15***)",
        "1 Tbsp parsley (chopped (optional), $0.10)"
      ],
      "instructions": [
        "Mince the garlic. Add the garlic and butter to a large pot or skillet and sauté over medium heat for about one minute, or until the garlic is soft and fragrant.",
        "Add the ground beef and continue to sauté until it is fully browned.",
        "While the beef is browning, slice the mushrooms. Add the sliced mushrooms and some freshly cracked pepper to the pot with the beef. Continue to sauté until the mushrooms are soft (about five minutes).",
        "Add the uncooked egg noodles to the pot along with the beef broth, Worcestershire sauce, and Dijon mustard. Stir to combine. The liquid will not fully cover the noodles, but that's okay.",
        "Place a lid on the pot and allow the liquid to come up to a boil over medium-high heat. As soon as it reaches a boil, give the pot a stir, replace the lid, and reduce the heat to low. Allow the pot to simmer on low heat for about 7-10 minutes, stirring occasionally and replacing the lid every couple of minutes. After 7-10 minutes the pasta should be tender and most of the liquid absorbed.",
        "Once the noodles are tender, add the sour cream and fold it into the noodles until everything is rich and creamy. Give the noodles a taste and add extra salt or pepper, if needed. Roughly chop a handful of parsley leaves and sprinkle over top. Serve hot."
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "meat"
      ],
      "source": {
        "name": "Budgetbytes",
        "url": "https://www.budgetbytes.com/beef-stroganoff/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:52.811712Z"
    },
    {
      "id": "chicken-stir-fry-recipe",
      "slug": "chicken-stir-fry-recipe",
      "title": "Chicken Stir Fry Recipe",
      "image": "https://www.budgetbytes.com/wp-content/uploads/2024/01/Chicken-Stir-Fry-Pan.jpg",
      "prepTime": "15 min",
      "cookTime": "20 min",
      "totalTime": "35 min",
      "servings": "6",
      "ingredients": [
        "⅓ cup soy sauce ($0.44)",
        "3 Tbsp brown sugar ($0.12)",
        "2 tsp toasted sesame oil ($0.20)",
        "2 cloves garlic, minced ($0.16)",
        "2 tsp grated fresh ginger ($0.20)",
        "1 ½ Tbsp cornstarch ($0.08)",
        "⅓ cup water ($0.00)",
        "1 tsp sriracha ($0.05)",
        "¾ lb. broccoli (1.75)",
        "2 carrots ($0.50)",
        "1 red bell pepper ($1.39)",
        "1 small onion ($0.39)",
        "2 green onions ($0.22)",
        "2 boneless, skinless chicken breasts (about 1.5 lb. total) ($6.25)",
        "3 Tbsp cooking oil, divided ($0.12)"
      ],
      "instructions": [
        "Start by making the stir fry sauce. Combine the soy sauce, brown sugar, toasted sesame oil, garlic, ginger, sriracha, cornstarch and water in a small bowl. Set the sauce aside.",
        "Chop the broccoli into small florets. Slice the red bell pepper, onion, and carrots into similar sized pieces. Slice the green onions. Set all the vegetables aside.",
        "Next, cut the chicken breasts into small ½ inch sized pieces.",
        "Heat a very large skillet or wok over medium-high heat. Once hot add 2 Tbsp of cooking oil and swirl to coat the surface of the skillet. Add the chicken and cook until browned on all sides. Be careful not to overcook the chicken. Once the chicken is browned, remove it from the skillet onto a separate plate and set aside.",
        "In the same skillet, add the remaining 1 Tbsp of cooking oil along with the carrots and broccoli. Cook and stir for one minute, or just until the broccoli begins to turn bright green.",
        "Next, add the red bell pepper and onion to the skillet. Continue to cook and stir for 1-2 more minutes.",
        "Give the stir fry sauce another brief stir. Now add the cooked chicken back to the skillet, then pour the stir fry sauce over the chicken and vegetables. Give everything a stir and allow the sauce to come up to a simmer, at which point it will start to thicken and turn glossy. Continue to cook for 1-2 more minutes or until it has reached your desired doneness.",
        "Remove it from the heat, top with green onions and sesame seeds (optional) and serve!"
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "poultry"
      ],
      "source": {
        "name": "Budgetbytes",
        "url": "https://www.budgetbytes.com/chicken-stir-fry/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:56.018262Z"
    },
    {
      "id": "chicken-stir-fry",
      "slug": "chicken-stir-fry",
      "title": "Chicken Stir Fry",
      "image": "https://www.allrecipes.com/thmb/xvlRRhK5ldXuGcXad8XDM5tTAfE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/223382_chicken-stir-fry_Rita-1x1-1-b6b835ccfc714bb6a8391a7c47a06a84.jpg",
      "prepTime": "20 min",
      "cookTime": "20 min",
      "totalTime": "40 min",
      "servings": "6",
      "ingredients": [
        "4 cups water",
        "2 cups white rice",
        "0.66666668653488 cup soy sauce",
        "0.25 cup brown sugar",
        "1 tablespoon cornstarch",
        "1 tablespoon minced fresh ginger",
        "1 tablespoon minced garlic",
        "0.25 teaspoon red pepper flakes",
        "3 skinless, boneless chicken breast halves, thinly sliced",
        "2 tablespoons sesame oil, divided",
        "1 head broccoli, broken into florets",
        "1 onion, cut into large chunks",
        "1 cup sliced carrots",
        "1 (8 ounce) can sliced water chestnuts, drained",
        "1 green bell pepper, cut into matchsticks"
      ],
      "instructions": [
        "Gather all ingredients.",
        "Bring water and rice to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes.",
        "Meanwhile, combine soy sauce, brown sugar, and cornstarch in a medium glass or ceramic bowl; stir until smooth.",
        "Stir in ginger, garlic, and red pepper flakes; add chicken and stir to coat. Cover and marinate in the refrigerator for at least 15 minutes.",
        "Heat 1 tablespoon sesame oil in a wok or large skillet over medium-high heat. Add broccoli, onion, carrots, water chestnuts, and bell pepper; cook and stir until just tender, about 5 minutes.",
        "Transfer vegetables into a dish; set aside.",
        "Heat remaining 1 tablespoon sesame oil in the same wok or skillet over medium-high heat. Add chicken, reserving marinade, and cook until just browned, about 2 minutes per side.",
        "Stir in vegetables and reserved marinade. Bring to a boil; cook and stir until chicken is no longer pink in the center and vegetables are tender, 5 to 7 minutes.",
        "Serve over rice."
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "poultry"
      ],
      "source": {
        "name": "Allrecipes",
        "url": "https://www.allrecipes.com/recipe/223382/chicken-stir-fry/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T03:59:59.406919Z"
    },
    {
      "id": "pad-thai",
      "slug": "pad-thai",
      "title": "Pad Thai",
      "image": "https://www.allrecipes.com/thmb/11HVKKh8OrlLC3RlS3Ikh5dN_lo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/42968-pad-thai-DDMFS-4x3-f46b490ef89b4694b8bf4c5ac54a486b.jpg",
      "prepTime": "10 min",
      "cookTime": "15 min",
      "totalTime": "45 min",
      "servings": "6",
      "ingredients": [
        "1 (12 ounce) package rice noodles",
        "2 tablespoons butter",
        "1 pound boneless, skinless chicken breast halves, cut into bite-sized pieces",
        "0.25 cup vegetable oil",
        "4 eggs",
        "3 tablespoons white sugar",
        "2 tablespoons fish sauce",
        "1 tablespoon white wine vinegar",
        "0.125 tablespoon crushed red pepper",
        "2 cups bean sprouts",
        "3 green onions, chopped",
        "0.25 cup crushed peanuts",
        "1 lemon, cut into wedges"
      ],
      "instructions": [
        "Gather all ingredients.",
        "Soak rice noodles in cold water until soft, 30 to 50 minutes. Drain and set aside.",
        "Meanwhile, heat butter in a wok; add chicken and sauté until browned. Remove chicken and set aside.",
        "Heat oil in the wok over medium-high heat. Crack eggs into hot oil and cook until firm. Stir in chicken and cook for 5 minutes.",
        "Add softened noodles, sugar, fish sauce, vinegar, and red pepper; mix well until noodles are tender. Adjust seasonings to taste.",
        "Stir bean sprouts into wok and cook for 3 minutes.",
        "Serve topped with green onions, crushed peanuts, and a wedge of lemon."
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy"
      ],
      "source": {
        "name": "Allrecipes",
        "url": "https://www.allrecipes.com/recipe/42968/pad-thai/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T04:00:02.755472Z"
    },
    {
      "id": "shrimp-scampi-with-pasta",
      "slug": "shrimp-scampi-with-pasta",
      "title": "Shrimp Scampi with Pasta",
      "image": "https://www.allrecipes.com/thmb/jiV_4f8vXFle1RdFLgd8-_31J3M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/229960-shrimp-scampi-with-pasta-DDMFS-4x3-e065ddef4e6d44479d37b4523808cc23.jpg",
      "prepTime": "20 min",
      "cookTime": "20 min",
      "totalTime": "40 min",
      "servings": "6",
      "ingredients": [
        "1 (16 ounce) package linguine pasta",
        "2 tablespoons butter",
        "2 tablespoons extra-virgin olive oil",
        "2 shallots, finely diced",
        "2 cloves garlic, minced",
        "1 pinch red pepper flakes",
        "1 pound shrimp, peeled and deveined",
        "1 pinch kosher salt and freshly ground pepper",
        "0.5 cup dry white wine",
        "1 lemon, juiced",
        "2 tablespoons butter",
        "2 tablespoons extra-virgin olive oil",
        "0.25 cup finely chopped fresh parsley leaves",
        "1 teaspoon extra-virgin olive oil, or to taste"
      ],
      "instructions": [
        "Gather ingredients.",
        "Bring a large pot of salted water to a boil; cook linguine in boiling water until nearly tender, 6 to 8 minutes. Drain.",
        "Melt 2 tablespoons butter with 2 tablespoons olive oil in a large skillet over medium heat.",
        "Cook and stir shallots, garlic, and red pepper flakes in the hot butter and oil until shallots are translucent, 3 to 4 minutes.",
        "Season shrimp with kosher salt and black pepper; add to the skillet and cook until pink, stirring occasionally, 2 to 3 minutes. Remove shrimp from skillet and keep warm.",
        "Pour white wine and lemon juice into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon.",
        "Melt 2 tablespoons butter in skillet, stir 2 tablespoons olive oil into butter mixture, and bring to a simmer.",
        "Toss linguine, shrimp, and parsley in the butter mixture until coated; season with salt and black pepper. Drizzle with 1 teaspoon olive oil to serve.",
        "Serve hot and enjoy!"
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "seafood",
        "pasta"
      ],
      "source": {
        "name": "Allrecipes",
        "url": "https://www.allrecipes.com/recipe/229960/shrimp-scampi-with-pasta/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T04:00:06.120363Z"
    },
    {
      "id": "lemon-garlic-salmon-tray-bake-easy-healthy",
      "slug": "lemon-garlic-salmon-tray-bake-easy-healthy",
      "title": "Lemon garlic salmon tray bake - easy & healthy!",
      "image": "https://www.recipetineats.com/tachyon/2024/02/Lemon-garlic-salmon-tray-bake_1.jpg",
      "prepTime": "10 min",
      "cookTime": "11 min",
      "totalTime": "10 min 11 min",
      "servings": "4",
      "ingredients": [
        "4 x 180g/6 oz salmon fillets (skin on or off, doesn't matter (Note 1))",
        "1 tsp lemon zest (1 lemon)",
        "1 tbsp lemon juice",
        "2 tbsp extra virgin olive oil",
        "1 tsp dijon mustard (Note 2)",
        "2 garlic cloves (grated using microplane (Note 3))",
        "1/2 tsp cooking salt / kosher salt",
        "1/4 tsp black pepper",
        "3 bunches asparagus (woody ends snapped or trimmed off (Note 4))",
        "200g/ 7 oz cherry tomatoes (or grape tomatoes, 1 Aussie punnet)",
        "2 tsp extra virgin olive oil",
        "1/4 tsp each salt and pepper",
        "Olive oil spray",
        "Parmesan (finely grated)",
        "Lemon wedges or slices (optional)",
        "Parsley (finely chopped, optional)",
        "Crusty bread or toast (for serving)"
      ],
      "instructions": [
        "Lemon garlic paste - Mix the marinade ingredients in a small bowl. Slather onto the top and sides of the salmon. If time permits, marinade for 1 hour. Otherwise, proceed with recipe.",
        "Preheat oven grill / broiler to 280°C/525°F or as high as yours goes. Place the oven shelf 20 cm /8\" from the heat source.",
        "Prepare tray - Toss the asparagus and cherry tomatoes with the olive oil, salt and pepper. Spread out on a large tray then clear space for the salmon. Place salmon on the tray leaving a bit of space between each. Spray surface of salmon with oil.",
        "Cook - Grill/broil for 11 minutes or until the salmon is done - the flesh should flake, the internal temperature should be 50°C/122°F (Note 5).",
        "Serve - Transfer salmon and vegetables to plate. Grate parmesan over the vegetables. Squeeze lemon juice over the salmon, sprinkle with parsley. Eat!"
      ],
      "tags": [
        "quick",
        "weeknight",
        "easy",
        "seafood",
        "vegetarian"
      ],
      "source": {
        "name": "Recipetineats",
        "url": "https://www.recipetineats.com/lemon-garlic-salmon/"
      },
      "theme": "Quick Weeknight Dinners",
      "difficulty": "Easy",
      "addedDate": "2026-01-18T04:00:09.976264Z"
    },
    {
      "id": "crispy-pan-fried-fish",
      "slug": "crispy-pan-fried-fish",
      "title": "Crispy Pan Fried Fish",
      "image": "https://www.recipetineats.com/tachyon/2017/06/Crispy-Pan-Fried-Fish-3-1.jpg",
      "prepTime": "3 min",
      "cookTime": "5 min",
      "totalTime": "8 min",
      "servings": "2",
      "ingredients": [
        "2 thin fish fillets, around 150g/5 oz each, 1 cm / 2/5\" thick, skin on or off (Note 1)",
        "Salt and pepper",
        "1/4 cup / 35g flour (plain/all purpose, wholemeal)",
        "1 tsp paprika (optional (Note 2))",
        "2 - 3 tbsp oil, enough to mostly thinly cover base (I use vegetable or canola)",
        "Lemon wedges",
        "Finely chopped parsley or dill (for garnish, optional)"
      ],
      "instructions": [
        "Use scrunched up paper towels to pat the fish dry on both sides. This is especially important if you are using thawed frozen fish.",
        "Season the fish well on both sides with salt and pepper (key!).",
        "Mix the flour and paprika on a plate.",
        "Coat fish on both sides with flour, pressing down firmly so it adheres, but shake well to remove excess. (Note 2)",
        "Heat a heavy based skillet (normal or non stick) over medium high heat until you see wisps of smoke. Add oil and swirl to coat the pan - it will heat within seconds.",
        "Add fish - it should sizzle straight away. Shake the pan lightly to move the fish. Cook for 2 minutes until golden and crisp, pressing down gently, then flip. Cook the other side for 2 minutes until crisp then remove.",
        "If it's browning too quickly, just remove pan from the stove briefly.  If it's stuck, don't move - it will release naturally once golden.",
        "Serve fish immediately with lemon wedges and garnished with dill or parsley, if using. It starts to lose crispiness after 5 minutes."
      ],
      "tags": [
        "quick",
        "easy"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/crispy-pan-fried-fish/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:36:59.620Z",
      "theme": "Quick Weeknight Dinners"
    },
    {
      "id": "honey-soy-chicken-marinade-and-sauce-excellent-grilled",
      "slug": "honey-soy-chicken-marinade-and-sauce-excellent-grilled",
      "title": "Honey Soy Chicken - Marinade and Sauce (excellent grilled!)",
      "image": "https://www.recipetineats.com/tachyon/2020/06/Honey-Soy-Chicken_4-Square.jpg",
      "prepTime": "10 min",
      "cookTime": "20 min",
      "totalTime": null,
      "servings": "5",
      "ingredients": [
        "1.25 - 1.5 kg/ 2.5 - 3 lb skinless boneless chicken thighs OR breast (Note 1)",
        "1 tbsp vegetable oil (for cooking)",
        "1/2 cup soy sauce (all purpose or light (not dark, Note 2))",
        "2/3 cup honey (sub maple syrup)",
        "1/3 cup cider vinegar (or rice vinegar)",
        "1/4 cup Chinese cooking wine or dry sherry (key ingredient, Note 3)",
        "1 tbsp sesame oil (toasted (Note 4))",
        "1 1/2 tbsp garlic (finely minced)",
        "1/3 cup water",
        "1 1/2 tsp cornflour/cornstarch",
        "Green onion (finely sliced)",
        "Sesame seeds"
      ],
      "instructions": [
        "Place ingredients in a jug and mix well until honey is completely dissolved.",
        "Reserve 1/4 cup for Basting, refrigerate. (Note 5)",
        "Reserve 2/3 cup for Serving Sauce, refrigerate.",
        "Marinade Chicken: Pour remaining marinade over chicken in a container. Coat chicken thoroughly. Cover, refrigerate 24 to 48 hours (minimum 3 hrs).",
        "Place reserved sauce in a small saucepan. Mix cornflour and water, then add into saucepan.",
        "Simmer over medium for 5 minutes, stirring regularly, until it thickens to a syrupy consistency. Set aside and keep warm. (If it gets too thick, just add a bit more water)",
        "Brush BBQ plate or grills with oil and heat to medium high. Or heat oil in a large skillet over medium high heat.",
        "THIGHS: Place chicken on BBQ. Cook the first side for 2 minutes, then flip and dab with reserved Basting Sauce. Cook for 2 minutes, flip and baste. Then flip/baste every 1 minute for total cook time of ~ 10 minutes or until a thermometer reads 75°C/165°F.",
        "BREAST: Cook first side 2 minutes, flip, baste. Cook 2 minutes, then flip and baste every 45 sec or so for total cook time of ~8 minutes (internal temp 66°C / 151°F).",
        "REST: Transfer to serving plate, cover loosely with foil and rest for 5 minutes.",
        "SERVE chicken garnished with sesame seeds and green onion, with sauce on the side so people can help themselves."
      ],
      "tags": [
        "quick",
        "easy"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/honey-soy-chicken/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:37:01.773Z",
      "theme": "Quick Weeknight Dinners"
    },
    {
      "id": "creamy-garlic-prawns-shrimp",
      "slug": "creamy-garlic-prawns-shrimp",
      "title": "Creamy Garlic Prawns (Shrimp)",
      "image": "https://www.recipetineats.com/tachyon/2020/09/Creamy-Garlic-Prawns_8-SQ.jpg",
      "prepTime": "5 min",
      "cookTime": "12 min",
      "totalTime": null,
      "servings": "4",
      "ingredients": [
        "500g / 1lb peeled prawns/shrimp (large/jumbo best (Note 1))",
        "1 garlic cloves (finely minced)",
        "1 tbsp olive oil",
        "1/2 tsp black pepper",
        "1/2 tsp salt",
        "15g / 1 tbsp unsalted butter",
        "2 garlic clove (finely minced)",
        "15g / 1 tbsp unsalted butter",
        "1/4 cup dry white wine ((or more chicken stock) (Note 2))",
        "1/2 cup chicken or vegetable stock/broth (low sodium)",
        "1 cup heavy/thickened cream",
        "1/2 cup parmesan (finely grated (grate your own, Note 3))",
        "2 tbsp parsley (finely chopped)"
      ],
      "instructions": [
        "Place prawns, garlic, oil and pepper in a bowl. Toss to coat, set aside 20 minutes if time permits (no longer).",
        "Stir through salt just prior to cooking.",
        "Melt 15g / 1 tbsp butter in a large skillet over medium high heat. Add half the prawns and cook for 1 minute on each side, then remove.",
        "Repeat with remaining prawns (you shouldn't need more butter), then remove. Scrape out excess remaining garlic from pan and add to cooked prawns.",
        "Add butter into skillet and let it melt. Add garlic and stir for 30 seconds or until light golden.",
        "Add white wine, turn up heat to high. Bring to simmer while stirring base of the pan to dissolve all the golden bits into the sauce. Cook 1 minute or until it most evaporates and the winey smell is gone.",
        "Add chicken stock and reduce until mostly gone and just a thin layer remains on base of skillet.",
        "Add cream, then simmer on medium heat for 2 minutes until reduced and slightly thickened.",
        "Stir through parmesan, then add the prawns back in. Taste sauce and see if more salt and pepper is needed.",
        "Serve sprinkled with parsley, over mashed potato or something to soak up that fabulous sauce!"
      ],
      "tags": [
        "quick",
        "easy"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/creamy-garlic-prawns/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:37:03.847Z",
      "theme": "Quick Weeknight Dinners"
    },
    {
      "id": "lemon-chicken-salad",
      "slug": "lemon-chicken-salad",
      "title": "Lemon Chicken Salad",
      "image": "https://www.recipetineats.com/tachyon/2018/07/Lemon-Chicken-Salad-1a.jpg",
      "prepTime": "15 min",
      "cookTime": "8 min",
      "totalTime": "23 min",
      "servings": "2",
      "ingredients": [
        "2 tsp lemon zest",
        "2 tbsp lemon juice",
        "1 tbsp honey",
        "1 tsp Dijon mustard",
        "3 tbsp extra virgin olive oil",
        "1 large garlic clove (minced)",
        "1/2 tsp salt + 1/4 tsp black pepper",
        "1 large chicken breast (halved horizontally* OR 2 boneless skinless chicken thighs)",
        "1 tbsp lemon juice (extra)",
        "Salt and pepper",
        "1/2 tbsp olive oil",
        "2 tbsp finely chopped dill",
        "8 cups cos/romaine lettuce (chopped (or other lettuce of choice, Note 2))",
        "1 cup cherry tomatoes (halved)",
        "1 medium avocado (quartered and sliced thickly)",
        "1/2 red onion (small, finely sliced)",
        "3/4 cup corn kernels (fresh or canned drained)",
        "120g/ 4 oz bacon (cooked then chopped (optional))"
      ],
      "instructions": [
        "Place Dressing ingredients in a jar. Shake well.",
        "Place chicken in a bowl. Add 2 tbsp Dressing, 1 tbsp extra lemon juice, plus a pinch of salt and pepper. Mix well. Marinate minimum 20 minutes up to 24 hours.",
        "Heat oil in a non stick skillet over medium high heat (or use bacon fat if you use bacon in this!). Add chicken and cook. Halved breasts: 2 minutes each side. Thigh: 4 minutes each side.",
        "Transfer to plate, cover loosely with foil for 3 minutes. Slice.",
        "Add dill into remaining dressing. Shake.",
        "Place remaining salad ingredients in a bowl. Top with chicken.",
        "Drizzle dressing all over. Crumble over bacon if using. Serve immediately!"
      ],
      "tags": [
        "quick",
        "easy"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/lemon-chicken/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:43:58.934Z",
      "theme": "Quick Weeknight Dinners"
    },
    {
      "id": "chicken-stroganoff",
      "slug": "chicken-stroganoff",
      "title": "Chicken Stroganoff",
      "image": "https://www.recipetineats.com/tachyon/2018/11/Chicken-Stroganoff_8.jpg",
      "prepTime": "5 min",
      "cookTime": "15 min",
      "totalTime": "20 min",
      "servings": "4",
      "ingredients": [
        "600g / 1.2 lb chicken thighs (4 - 5) (boneless skinless (or breast or tenderloin, Note 1))",
        "1 tsp garlic powder",
        "Salt and pepper",
        "1 tbsp olive oil",
        "1 large onion (chopped)",
        "300g / 10oz mushrooms (sliced (not too thin))",
        "40g / 3 tbsp butter",
        "2 tbsp flour (Note 2)",
        "2 cups / 500 ml beef broth/stock (salt reduced)",
        "1 tbsp Dijon mustard",
        "2/3 cup (150g) sour cream (or yogurt)",
        "250 - 300 g / 8 - 10 oz pasta or egg noodles of choice (Note 3)",
        "Chopped parsley or chives (for garnish (optional))"
      ],
      "instructions": [
        "Sprinkle chicken with garlic powder, salt and pepper on both sides.",
        "Heat oil in a large skillet over medium heat. Place chicken in skillet smooth side down.",
        "Press down lightly with with spatula. Cook for 4 minutes until golden.",
        "Turn and press lightly with spatula. Cook for 2 minutes.",
        "Remove chicken onto a plate.",
        "Turn heat up to medium high. Add butter, melt. Then add onions, cook for 1 minute, then add mushrooms.",
        "Cook mushrooms until golden. Scrape bottom of fry pan to get all the golden bits off (this is flavour!).",
        "Add flour, cook, stirring, for 1 minute.",
        "Add half the broth while stirring. Once incorporated, add remaining broth.",
        "Stir, then add sour cream and mustard. Stir until incorporated (don't worry if it looks split, sour cream will \"melt\" as it heats).",
        "Bring to simmer ,then reduce heat to medium low. Once it thickens to the consistency of pouring cream (3 minutes), adjust salt and pepper to taste.",
        "Add chicken back in (including plate juices). Simmer for 1 minute, then remove from stove.",
        "Serve over pasta or egg noodles, sprinkled with parsley or chives if desired."
      ],
      "tags": [
        "quick",
        "easy"
      ],
      "source": {
        "name": "recipetineats.com",
        "url": "https://www.recipetineats.com/chicken-stroganoff/"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:44:00.735Z",
      "theme": "Quick Weeknight Dinners"
    },
    {
      "id": "beef-ginger-stir-fry",
      "slug": "beef-ginger-stir-fry",
      "title": "Beef & ginger stir-fry",
      "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-516670_12-d60c5f8.jpg?resize=440,400",
      "prepTime": "20 min",
      "cookTime": "10 min",
      "totalTime": "30 min",
      "servings": "4",
      "ingredients": [
        "500g beef rump, trimmed and cut into thin strips",
        "1 tsp Chinese five-spice powder",
        "300g pack ready-cooked rice noodle",
        "1 large red chilli",
        "1 fat garlic clove chopped",
        "4cm piece ginger peeled and cut into matchsticks",
        "1 stick lemongrass trimmed and sliced",
        "2 tbsp sunflower oil",
        "100g sugar snap peas cut into thin strips",
        "8 baby corn sliced diagonally",
        "6 spring onions trimmed and sliced diagonally",
        "&frac12; lime",
        "2 tbsp soy sauce",
        "1 tbsp fish sauce",
        "2 tbsp roasted peanut",
        "roughly chopped coriander to serve"
      ],
      "instructions": [
        "Mix the beef and five-spice in a bowl, then set aside to marinate. Soften the noodles in boiling water following pack instructions, drain then set aside. Thinly slice the red chilli, leaving the seeds if you prefer a little extra heat. Mix with the garlic, ginger and lemongrass in a small bowl. Heat half the oil in a wok, add the chilli mixture and stir-fry for 1 min until softened but not coloured. Remove with a slotted spoon and set aside while you cook the beef.",
        "Heat the remaining oil, add the beef and stir-fry over a high heat for 1 min until browned and just cooked through.",
        "Return the chilli mixture to the pan with the sugar snaps, baby corn and half the spring onions. Stir-fry for 1 min more before adding the drained noodles. Mix to thoroughly combine, take off the heat and add a squeeze of lime juice, the soy sauce and fish sauce.",
        "Divide between four plates. Scatter with the peanuts, garnish with remaining spring onions and chopped coriander."
      ],
      "tags": [
        "quick",
        "easy"
      ],
      "source": {
        "name": "bbcgoodfood.com",
        "url": "https://www.bbcgoodfood.com/recipes/beef-stir-fry"
      },
      "difficulty": "Medium",
      "addedDate": "2026-01-18T06:46:43.296Z",
      "theme": "Quick Weeknight Dinners"
    }
  ]
}